of222/tutorials/rheoEFoam/EEI/PoissonBoltzmann/CrossSlot/0/C.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet_top
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    
    inlet_down
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    walls
    {
        type            zeroGradient;
    }

    outlet_left
    {
        type            zeroGradient;
    }

    outlet_right
    {
        type            zeroGradient;
    }
    
    "(top|base)"
    {
        type            empty;
    }
}

// ************************************************************************* //
