of222/tutorials/rheoEFoam/EEI/PoissonBoltzmann/CrossSlot/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet_top
    {
        type            patch;
        nFaces          320;
        startFace       105040;
    }
    outlet_right
    {
        type            patch;
        nFaces          320;
        startFace       105360;
    }
    base
    {
        type            empty;
        inGroups        1(empty);
        nFaces          53000;
        startFace       105680;
    }
    top
    {
        type            empty;
        inGroups        1(empty);
        nFaces          53000;
        startFace       158680;
    }
    walls
    {
        type            wall;
        nFaces          1280;
        startFace       211680;
    }
)

// ************************************************************************* //
